Tekla Open API Reference for Tekla Structures 2025
LayoutAttributes.ListHiddenObjectsInTemplates Property
 Gets or sets the property for controlling whether to list hidden objects in templates.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ListHiddenObjectsInTemplates { get; set; }
Public Property ListHiddenObjectsInTemplates As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
LayoutAttributes Class
Tekla.Structures.Drawing Namespace